; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph0 - mode
	image1 - mode
	infrared3 - mode
	image2 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star7 - direction
	Star9 - direction
	GroundStation2 - direction
	Star11 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation12 - direction
	Star14 - direction
	Star5 - direction
	Star6 - direction
	GroundStation13 - direction
	GroundStation10 - direction
	GroundStation8 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument1 infrared3)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 Star6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star5)
	(supports instrument4 image1)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation10)
	(supports instrument5 image2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 GroundStation13)
	(calibration_target instrument6 Star14)
	(supports instrument7 image1)
	(calibration_target instrument7 Star6)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon20)
	(supports instrument8 image1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation13)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation10)
	(calibration_target instrument9 GroundStation13)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared3)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation8)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star17)
)
(:goal (and
	(pointing satellite3 Star19)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Star17 image1)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
	(have_image Phenomenon20 image2)
	(have_image Planet21 thermograph0)
))

)

; plan
1. (turn_to satellite3 star19 phenomenon20)
   deleted: (pointing satellite3 phenomenon20)
   added: (pointing satellite3 star19)
   goals met: 1 of 8
2. (turn_to satellite2 groundstation13 groundstation10)
   deleted: (pointing satellite2 groundstation10)
   added: (pointing satellite2 groundstation13)
   goals met: 1 of 8
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 8
4. (calibrate satellite2 instrument4 groundstation13)
   added: (calibrated instrument4)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon20 groundstation13)
   deleted: (pointing satellite2 groundstation13)
   added: (pointing satellite2 phenomenon20)
   goals met: 1 of 8
6. (take_image satellite2 phenomenon20 instrument4 image2)
   added: (have_image phenomenon20 image2)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon16 phenomenon20)
   deleted: (pointing satellite2 phenomenon20)
   added: (pointing satellite2 phenomenon16)
   goals met: 2 of 8
8. (take_image satellite2 phenomenon16 instrument4 image2)
   added: (have_image phenomenon16 image2)
   goals met: 3 of 8
9. (turn_to satellite2 phenomenon15 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon15)
   goals met: 3 of 8
10. (take_image satellite2 phenomenon15 instrument4 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 4 of 8
11. (turn_to satellite2 planet21 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 planet21)
   goals met: 4 of 8
12. (take_image satellite2 planet21 instrument4 thermograph0)
   added: (have_image planet21 thermograph0)
   goals met: 5 of 8
13. (turn_to satellite2 star17 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 star17)
   goals met: 5 of 8
14. (take_image satellite2 star17 instrument4 image1)
   added: (have_image star17 image1)
   goals met: 6 of 8
15. (turn_to satellite2 star18 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star18)
   goals met: 6 of 8
16. (take_image satellite2 star18 instrument4 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 7 of 8
17. (turn_to satellite2 star19 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 star19)
   goals met: 7 of 8
18. (take_image satellite2 star19 instrument4 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 8 of 8
